OpenFOAM-5/chapter2/ellipsoidal/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    fixedWall
    {
//        type            zeroGradient;
	type            fixedFluxPressure; //buoyantPressure;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }

    top
    {
	type		fixedValue;
	value           $internalField;
    }
    axis            
    {
	type		empty;   
    }    
}


// ************************************************************************* //
